var quizQuestions = [
    {
        question: "Воспитание – это…",
        answers: [
            {
                type: "True",
                content: "целенаправленный процесс формирования поведения"
            },
            {
                type: "false1",
                content: "создаваемая система внешних условий для развития человека"
            },
            {
                type: "false2",
                content: "процесс и результат усвоения опыта поколений как системы новых знаний, навыков, умений"
            },
            {
                type: "false3",
                content: "формирование личности обучающегося путем стимулирования  деятельности"
            }
        ]
    },
    {
        question: "Что из перечисленного не относится к функциям воспитания?",
        answers: [
            {
                type: "false1",
                content: "созидательно-культурная функция"
            },
            {
                type: "True",
                content: "образовательная функция"
            },
            {
                type: "false2",
                content: "социальная функция"
            },
            {
                type: "false3",
                content: "человекообразующая функцияи"
            }
        ]
    },
    {
        question: "По какому признаку классифицируются следующие виды воспитания: авторитарное, демократическое, либеральное, свободное?",
        answers: [
            {
                type: "false1",
                content: "по институциональному признаку"
            },
            {
                type: "false2",
                content: "по направлениям воспитательной работы"
            },
            {
                type: "false3",
                content: "по формированию личности путем приобщения к ценностям культуры"
            },
            {
                type: "True",
                content: "по стилю отношений между педагогом и обучающимся"
            }
        ]
    },
    {
        question: "Какое направление воспитанния  не относится к основным составляющим воспитания?",
        answers: [
            {
                type: "false1",
                content: "экологическое, семейное, гендерное воспитание"
            },
            {
                type: "false2",
                content: "идеологическое, гражданское и патриотическое"
            },
            {
                type: "false3",
                content: "воспитание культуры самопознания и саморегуляции личности;  воспитание культуры быта и досуга"
            },
            {
                type: "True",
                content: "социально-профессиональное воспитание"
            }
        ]
    },
    {
        question: "Воспитание духовное - ...",
        answers: [
            {
                type: "false1",
                content: "изменение потребностей в сторону повышения социальных ценностей: профессионализма, гражданственности"
            },
            {
                type: "True",
                content: "изменение потребностей в сторону повышения уровня нравственности, предпочтения духовных ценностей"
            },
            {
                type: "false3",
                content: "изменение потребностей в сторону повышения семейных ценностей"
            },
            {
                type: "false2",
                content: "изменение потребностей в сторону повышения индивидуальных ценностей (пол, здоровье, жизнедеятельность)"
            }
        ]
    },
    {
        question: "Созидательно-культурная функция воспитания заключается в ...",
        answers: [
            {
                type: "false1",
                content: "в формировании сознания человека"
            },
            {
                type: "false2",
                content: "обеспечении процесса смены поколений, формировании характера человека, развитии его способности преодолевать жизненные препятствия, адаптироваться к социальной среде, нести ответственность"
            },
            {
                type: "True",
                content: "сохранении, передаче и воспроизводстве культуры; обеспечении возможностей для личностного и профессионального роста, самореализации и творчества"
            },
            {
                type: "false3",
                content: "развитии творческого потенциала личности, его способностей и умений, обеспечении достижения человеком интеллектуально-нравственной свободы и счастья"
            }
        ]
    },
    {
        question: "Социальная функция воспитания заключается в ...",
        answers: [
            {
                type: "false1",
                content: "в формировании сознания человека"
            },
            {
                type: "false2",
                content: "сохранении, передаче и воспроизводстве культуры; обеспечении возможностей для личностного и профессионального роста, самореализации и творчества"
            },
            {
                type: "True",
                content: "обеспечении процесса смены поколений, формировании характера человека, развитии его способности преодолевать жизненные препятствия, адаптироваться к социальной среде, нести ответственность"
            },
            {
                type: "false3",
                content: "развитии творческого потенциала личности, его способностей и умений, обеспечении достижения человеком интеллектуально-нравственной свободы и счастья"
            }
        ]
    },
    {
        question: "Воспитание социальное - ...",
        answers: [
            {
                type: "True",
                content: "изменение потребностей в сторону повышения социальных ценностей: профессионализма, гражданственности"
            },
            {
                type: "false1",
                content: "изменение потребностей в сторону повышения уровня нравственности, предпочтения духовных ценностей"
            },
            {
                type: "false2",
                content: "изменение потребностей в сторону повышения индивидуальных ценностей (пол, здоровье, жизнедеятельность)"
            },
            {
                type: "false3",
                content: "изменение потребностей в сторону повышения семейных ценностей"
            }
        ]
    },
    {
        question: "Человеко-образующая функция воспитания заключается в ...",
        answers: [
            {
                type: "false1",
                content: "обеспечении процесса смены поколений, формировании характера человека, развитии его способности преодолевать жизненные препятствия, адаптироваться к социальной среде, нести ответственность"
            },
            {
                type: "false2",
                content: "сохранении, передаче и воспроизводстве культуры; обеспечении возможностей для личностного и профессионального роста, самореализации и творчестваU"
            },
            {
                type: "True",
                content: "развитии творческого потенциала личности, его способностей и умений, обеспечении достижения человеком интеллектуально-нравственной свободы и счастья"
            },
            {
                type: "false3",
                content: "в формировании сознания человека"
            }
        ]
    },
    {
        question: "Какова цель воспитания в Концепции непрерывного воспитания детей и учащейся молодежи в Республике Беларусь?",
        answers: [
            {
                type: "false1",
                content: "формирование нравственной культуры личностиe"
            },
            {
                type: "false2",
                content: "всестороннее и гармоническое развитие личности"
            },
            {
                type: "false3",
                content: "раскрытие творческих способностей человека4"
            },
            {
                type: "True",
                content: "формирование разносторонне развитой, нравственно зрелой, творческой личности"
            }
        ]
    }
  ];
  
  export default quizQuestions;
  